AreaPlanTopologiesInterface.getDuplicateRoomIdToRepresentativeRoomIdByLevelId
Categorized by level, for each of the inner maps, you can use the ElementId of a duplicate room, to query for it's "representative" room,
which is simply one of the rooms of the set of duplicate rooms that can be used to represent values for all other redundant rooms.
If the room you query isn't found, that means the room is unique, and not duplicate to any other rooms.
In this context, a set of duplicate rooms is considered the union of the representative room plus all the other rooms that are redundant.

AreaPlanTopologiesInterface.updateRedundantRoomsAtLevel(ElementId,crs.Map&lt;Topology.Space,crs_impl.Set&lt;ElementId,std.less&lt;ElementId&gt;,tnallc&lt;ElementId&gt;&gt;,std.less&lt;Topology.Space&gt;,tnallc&lt;std.pair&lt;Topology.Space!System.Runtime.CompilerServices.IsConst,crs_impl.Set&lt;ElementId,std.less&lt;ElementId&gt;,tnallc&lt;ElementId&gt;&gt;&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Clear the current record of which rooms are redundant at a particular level, and update with the provided SpaceRoomMap.
Any buckets in the SpaceRoomMap with less than 2 elements will be discarded, since they do not represent redundant rooms.

AreaPlanTopologiesInterface.hasRedundantRoomsAtLevel(ElementId)
Returns true if there are any redundant rooms in the given level

AreaPlanTopologiesInterface.getDuplicateRoomIdToRepresentativeRoomIdAtLevel(ElementId)
Returns all the IDs of duplicate rooms at the specified level, mapped to their representative room, including the representative room itself.
Returns reference to empty map if nothing is found.

AreaPlanTopologiesInterface.roomAtLevelIsRepresentedBy(ElementId,ElementId)
Returns true if the provided RommElem ID is the representative room of a set of duplicate rooms.
Given the level and ID for a RoomElem, return the "representative" room, i.e. the representantive of the set of duplicate rooms the provided room is part of.
If the given room is unique, then invalidID is returned.
If the given room is redundant or is the representative room itself, the ID of the representative room is returned.

AreaPlanTopologiesInterface.roomAtLevelIsRepresentative(ElementId,ElementId)
Returns true if the provided RoomElem ID is the representative of a set of duplicate rooms

AreaPlanTopologiesInterface.roomAtLevelIsRedundant(ElementId,ElementId)
Returns true if the provided RoomElem ID is part of a set of duplicate rooms and is NOT the representative of that set
The representative of the set of duplicate rooms is not considered redundant